Repository: jordimas/SoftTransEval-CAT
Catalog: dataset/dataset.tmx
Source language: en
Languages: ca

source: Supported File Types
ca: Tipus de fitxers suportats

source: To scan a document from your scanner:
ca: Per a escanejar un document des de l'escàner:

source: What is a Profiler?
ca: Què és un analitzador de rendiment?

source: If you are spawning a process that requires access to your current display, such as a GTK+ application, you will want to make sure <em>Inherit current environment</em> is set.
ca: Quan genereu un procés que requereix accés a la pantalla actual, com ara una aplicació GTK+, assegureu-vos que s'ha configurat <em>Hereta l'entorn actual</em>.

source: Optimizing compilers
ca: Optimització de compiladors

source: Replace <var>Files</var> with the name of the application.
ca: Reemplaceu <var>Fitxer</var> amb el nom de l'aplicació.

source: Possible values
ca: Valors possibles

source: Right or bottom color when drawing gradients, not used for solid color.
ca: Color dret o inferior quan es dibuixen degradats, no usat per al color sòlid.

source: System-wide default settings can be set by providing a default for a key in a <_:sys-1/> profile. These defaults can be overridden by the user.
ca: La configuració per defecte del sistema es pot establir proporcionant una tecla per defecte en un <_:sys-1/>perfil. L'usuari pot substituir aquestes tecles.

source: System database files, located in <_:file-1/>, cannot be edited because they are written in GVDB format. In order to change system settings using a text editor, you can modify <em>keyfiles</em> found in <em>keyfile directories</em>. Each keyfile directory corresponds to a particular system database file, and has the same name as the database file with a “.d” extension appended (for example, <file>/etc/dconf/db/local.d</file>). All keyfile directories are found in <_:file-2/>, and each one contains keyfiles in a special format that can be compiled into the <_:sys-3/> database.
ca: Els fitxers de dades del sistema, ubicats a <_:file-1/>, no es poden editar perquè estan escrits amb format GVDB. Per a canviar la configuració del sistema amb un editor de text, pots modificar els <em> fitxers de claus</em> que es troben als <em>directoris de fitxers de claus</em>. Cada directori de fitxers de claus correspon a un fitxer de base de dades concret del sistema, i té el mateix nom que el fitxer de base de dades amb una extensió ".d" afegida (per exemple: <file>/etc/dconf/db/local.d</file>). Tots els directoris de fitxers de claus es troben a <_:file-2/>, i cadascun conté fitxers de claus en un format especial que es pot compilar a dins de la <_:sys-3/> base de dades.

source: At this point, you should have <link xref="dconf-profiles">a <sys>user</sys> profile</link> and <link xref="dconf-keyfiles">a keyfile</link> with the settings that you want to lock down.
ca: En aquest punt, us cal tindre <link xref="dconf-profiles">un perfil <sys>d'usuari</sys></link> i <link xref="dconf-keyfiles">un fitxer de clau</link> amb els paràmetres que voleu bloquejar.

source: <sys>dconf</sys> is one of the main configuration utilities in GNOME. Its purpose is to help you set and manage GNOME system and application settings.
ca: <sys>dconf</sys> és una de les principals utilitats de configuració a GNOME. El seu objectiu és ajudar a configurar i gestionar el sistema de GNOME i la configuració de les aplicacions.

source: Sample profile
ca: Exemple de perfil

source: Customize the default favorites in the Activities overview.
ca: Personalitza els favorits predeterminats a la vista general d'Activitats.

source: To prevent the user from overriding these settings, create the file <file>/etc/dconf/db/local.d/locks/favorite-apps</file> with the following content:
ca: Per a evitar que l'usuari sobreescrigui aquesta configuració, creeu el fitxer <file>/etc/dconf/db/local.d/locks/favorite-apps</file> amb el contingut següent:

source: Change the lock screen shield
ca: Canviar la pantalla de bloqueig

source: Enable GNOME Shell extensions for all users.
ca: Activeu les extensions del GNOME Shell per a tots els usuaris.

source: Locking down the <code>org.gnome.shell.development-tools</code> key ensures that the user cannot use GNOME Shell’s integrated debugger and inspector tool (<app>Looking Glass</app>) to disable any mandatory extensions.
ca: Bloquejant la clau <code>org.gnome.shell.development-tools</code> us assegureu que l'usuari no pot utilitzar l'eina de depuració i inspecció integrada amb el GNOME Shell (<app>Looking Glass</app>) per desactivar les extensions d'ús obligatori.

source: On the top bar of <app>Looking Glass</app>, click <gui>Extensions</gui> to open the list of installed extensions.
ca: A la barra superior de <app>Looking Glass</app>, feu clic a <gui>Extensions</gui> per a obrir la llista d'extensions instal·lades.

source: Add extra fonts for individual users.
ca: Afegir fonts addicionals per a usuaris individuals.

source: <app>dconf-editor</app> may be better to use if you are not familiar with the options available in an application. It shows the hierarchy of settings in a tree-view and also displays additional information about each setting, including the description, type and default value.
ca: El <app>dconf-editor</app> pot ser millor utilitzar-lo si no esteu familiaritzats amb les opcions disponibles en una aplicació. Mostra la jerarquia de la configuració en una vista en arbre i també mostra informació addicional sobre cada configuració, incloent-hi la descripció, el tipus i el valor predeterminat.

source: If you want to set a different key than Right <key>Alt</key>, replace <var>ralt</var> with the name of that key as specified in the <link href="man:xkeyboard-config"><cmd>xkeyboard-config</cmd>(7)</link> man page, section <em>Position of Compose key</em>.
ca: Si voleu establir una tecla diferent a la dreta <key>Alt</key>, reemplaceu <var>ralt</var> amb el nom de la tecla especificada a la pàgina man <link href="man:xkeyboard-config"><cmd>xkeyboard-config</cmd>(7)</link>, secció <em>Posició de la tecla de composició</em>.

source: Log out to find that the defined layouts are available at the top bar on the login screen.
ca: Finalitzeu la sessió per a veure que els formats definits estan disponibles a la barra superior a la finestra de registre.

source: Remove <app>Terminal</app> and all other terminal applications from the <gui>Activities</gui> overview in GNOME Shell. You will also need to prevent the user from installing a new terminal application.
ca: Elimineu <app>Terminal</app> i totes les altres aplicacions des de la vista general d'<gui>Activitats</gui> del GNOME Shell. També haureu d'evitar que l'usuari instal·li una nova aplicació de terminal.

source: Restart the X server for the changes to take effect.
ca: Reinicieu el servidor X per a que el canvi tingui efecte.

source: Users can evade the logout lockdown by switching to a different user. That is the reason why it is recommended to also disable <em>user switching</em> when configuring the system.
ca: Els usuaris poden evadir el bloqueig per desconnexió commutant a un usuari diferent. Aquest és el motiu pel qual es recomana també deshabilitar <em>Canvi d'usuari</em> quan es configura el sistema.

source: disable all online accounts.
ca: desactivar tots els comptes en línia.

source: Disable printing
ca: Desactivar la impressió

source: Delete any actions you do not need from within the <code>policyconfig</code> element and add the following lines to the <file>/etc/polkit-1/actions/org.freedesktop.udisks2.policy</file> file:
ca: Elimineu totes les accions que no necessiteu dins de l'element <code>policyconfig</code> i afegiu les línies següents al fitxer <file>/etc/polkit-1/actions/org.freedesktop.udisks2.policy</file>:

source: See <link xref="login-automatic"/> for more information.
ca: Mireu <link xref="login-automatic"/> per a veure més informació.

source: There is no character limit for the banner message. <sys>gnome-shell</sys> autodetects longer stretches of text and enters two column mode.
ca: No hi ha límit de caràcters per al missatge del bàner. <sys> gnome-shell </sys> autodetecta extensions de text més llargues i entra en el mode de dues columnes.

source: Type the name of your domain in the <gui>Domain</gui> field if it is not already prefilled.
ca: Escriviu el nom del vostre domini al camp <gui>Domini</gui> si no està ple.

source: Troubleshoot and advanced setup
ca: Resolució de problemes i configuració avançada

source: # Specify the dconf path [org/gnome/login-screen] # Disable fingerprint reader enable-fingerprint-authentication=false
ca: # Especifica el camí a dconf [org/gnome/login-screen] # Desactiva el lector d'empremtes enable-fingerprint-authentication=false

source: Create a <sys>gdm</sys> keyfile for machine-wide settings in <file>/etc/dconf/db/gdm.d/00-login-screen</file>:
ca: Crear un fitxer clau <sys>gdm</sys> per a configurar l'equip a <file>/etc/dconf/db/gdm.d/00-login-screen</file>:

source: To override the system defaults for all users on the system, you need to create a <file>/etc/xdg/mimeapps.list</file> or <file>/etc/xdg/gnome-mimeapps.list</file> file with a list of MIME types for which you want to override the default registered application.
ca: Per substituir els valors predeterminats del sistema per a tots els usuaris del sistema, heu de crear un fitxer <file>/etc/xdg/mimeapps.list</file> o <file>/etc/xdg/gnome-mimeapps.list</file> amb una llista de tipus MIME per als quals voleu sobreescriure l'aplicació registrada per defecte.

source: To override the system defaults for individual users, you need to create a <file>~/.config/mimeapps.list</file> file with a list of MIME types for which you want to override the default registered application.
ca: Per sobreescriure els valors per defecte del sistema per als usuaris individuals, us cal crear un fitxer <file>~/.config/mimeapps.list</file> amb una llista de tipus MIME per als quals voleu sobreescriure l'aplicació registrada per defecte.

source: [Desktop Entry] Type=Application MimeType=application/x-newtype Name=<var>My Application 1</var> Exec=<var>myapplication1</var>
ca: [Entrada Escriptori] Type=Application MimeType=application/x-newtype Name=<var>My Application 1</var> Exec=<var>myapplication1</var>

source: Add a custom MIME type for individual users
ca: Afegir un MIME personalitzat per a usuaris individuals

source: In GNOME, MIME (<em>Multipurpose Internet Mail Extension</em>) types are used to identify the format of a file. The GNOME Desktop uses MIME types to:
ca: A GNOME, els tipus MIME (<em>Multipurpose Internet Mail Extension</em>) s'utilitzen per a identificar el format d'un fitxer. L'escriptori de GNOME utilitza els tipus MIME per:

source: The MIME database is a collection of all MIME type specification files that GNOME uses to store information about known MIME types.
ca: La base de dades MIME és una col·lecció de tots els fitxers d'especificació dels tipus MIME, que utilitza el GNOME per a emmagatzemar informació sobre tipus coneguts.

source: How do I preconfigure VPN for all my users?
ca: Com preconfiguro VPN per a tots els meus usuaris?

source: Dim screen when user is idle
ca: Atenuar la pantalla quan l'usuari estigui inactiu

source: Typical processes
ca: Processos típics

source: various <app>GVFS</app> processes
ca: diversos processos <app>GVFS</app>

source: On a Debian or Debian-based system, the following error may occur:
ca: A Debian o sistemes basats en Debian, es pot produir el següent error:

source: Determine your user ID (<sys>uid</sys>) by running the following command:
ca: Determineu el vostre ID d'usuari (<sys>uid</sys>) executant l'ordre següent:

source: Lock down settings
ca: Bloquejar els paràmetres

source: Channels.
ca: Canals.

source: Videos
ca: Vídeos

source: To change to another video, press the <gui style="button">Arrow back</gui> button in the upper left corner.
ca: Per a canviar a un altre vídeo, premeu el botó de <gui style="button">Fletxa enrere</gui> a la part superior esquerra de la pantalla.

source: You can navigate while watching the movie:
ca: Podeu navegar mentre mireu la pel·lícula:

source: Tick the option <gui>Load subtitle files when movie is loaded</gui> if you want subtitles to be loaded automatically.
ca: Seleccioneu la casella <gui>Carrega els fitxers de subtítol quan es carrega una pel·lícula</gui> si voleu carregar els fitxers de subtítol automàticament.
